blogger/app/controllers/articles_controller.rb

    def index
        @articles = Article.all
---
SELECT "articles".* FROM "articles"

    def create
        @article = Article.new(article_params)
        @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "The history of human kind"], ["body", ""], ["created_at", "2020-02-21 09:43:17.767583"], ["updated_at", "2020-02-21 09:43:17.767583"]]

    def destroy
        @article = Article.find(params[:id])
        @article.destroy
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 7]]

    def edit
        @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

    def update
        @article = Article.find(params[:id])
        @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "Neco sape"], ["updated_at", "2020-02-14 11:33:18.758885"], ["id", 6]]