blogger/app/controllers/authors_controller.rb

  def index
    @authors = Author.all
---
SELECT "authors".* FROM "authors"

  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("username", "email", "crypted_password", "salt", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @author.update(author_params)
---
UPDATE "authors" SET "email" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["email", "daktei7@gmail.com"], ["updated_at", "2020-02-22 10:43:30.101209"], ["id", 4]]

  def destroy
    @author.destroy
---
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 2]]

    def set_author
      @author = Author.find(params[:id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]