blogger/app/controllers/comments_controller.rb

    def create
        @comment = Comment.new(comment_params)
        @comment.article_id = params[:article_id]

        @comment.save
---
INSERT INTO "comments" ("author_name", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_name", "NecoQK"], ["body", "Spaeee"], ["article_id", 8], ["created_at", "2020-02-21 09:43:24.711708"], ["updated_at", "2020-02-21 09:43:24.711708"]]