blogger/app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags"
---
    def index
        @tags = Tag.all

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def show
    @tag = Tag.find(params[:id])

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 13]]
---
    def destroy
    @tag = Tag.find(params[:id])
    @tag.destroy